package com.bolema.phonelive.bean;

/**
 * 歌词
 * Created by yuanshuo on 2017/2/3.
 */

public class MusicLrcBean {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"ret_code":0,"lyric":"[ti&#58;胡桃夹子&#32;&#40;《健忘村》电影推广曲&#41;]&#10;[ar&#58;张碧晨]&#10;[al&#58;胡桃夹子]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;10]胡桃夹子&#32;&#45;&#32;张碧晨&#10;[00&#58;00&#46;20]&#10;[00&#58;05&#46;21]词：张碧晨&#10;[00&#58;06&#46;03]曲：张碧晨&#10;[00&#58;06&#46;85]编曲：刘卓/邢迟&#10;[00&#58;08&#46;17]钢琴：刘卓&#10;[00&#58;09&#46;00]弦乐：亚洲爱乐乐团/首席/李朋&#10;[00&#58;11&#46;45]和声编写：Brandy&#32;Tien&#10;[00&#58;12&#46;57]和声：Brandy&#32;Tien&#10;[00&#58;13&#46;38]混音：赵靖&#10;[00&#58;16&#46;05]&#10;[00&#58;17&#46;90]它&#32;摊开双手&#32;它&#32;垂着头&#10;[00&#58;24&#46;24]&#10;[00&#58;25&#46;19]它&#32;从来看不到&#32;这周遭&#10;[00&#58;30&#46;97]&#10;[00&#58;31&#46;97]它&#32;站住双脚&#32;它&#32;冰冻了脸庞&#10;[00&#58;38&#46;23]&#10;[00&#58;39&#46;01]它不曾察觉&#32;眼中的迷惘&#10;[00&#58;46&#46;75]&#10;[00&#58;47&#46;68]蒙尘的镜子里面&#32;困住一个人&#10;[00&#58;53&#46;22]触不到&#32;时光里的温度&#10;[00&#58;57&#46;83]胆怯的心跳&#32;骄傲的头&#10;[01&#58;02&#46;39]抚平的只是孤独&#10;[01&#58;07&#46;71]观望着喜怒哀乐&#32;变换的故事&#10;[01&#58;12&#46;90]它注定&#32;被寂寞囚牢&#10;[01&#58;18&#46;25]它反复逃离反复失落&#10;[01&#58;23&#46;34]反复同行了落魄&#10;[01&#58;29&#46;96]&#10;[01&#58;47&#46;19]风触碰悲伤&#32;带不走痛&#10;[01&#58;53&#46;00]&#10;[01&#58;53&#46;86]可它&#32;早就不在乎&#32;痛不痛&#10;[02&#58;00&#46;05]&#10;[02&#58;00&#46;86]张不开的口&#32;再咬不开外壳&#10;[02&#58;07&#46;76]它决然抹去&#32;全部的存在&#10;[02&#58;15&#46;03]&#10;[02&#58;16&#46;44]蒙尘的镜子里面困住一个人&#10;[02&#58;21&#46;99]触不到&#32;时光里的温度&#10;[02&#58;26&#46;76]胆怯的心跳&#32;骄傲的头&#10;[02&#58;31&#46;30]抚平的只是孤独&#10;[02&#58;36&#46;02]&#10;[02&#58;36&#46;62]观望着喜怒哀乐&#32;变换的故事&#10;[02&#58;41&#46;88]它注定&#32;被寂寞囚牢&#10;[02&#58;47&#46;14]它反复逃离反复失落&#10;[02&#58;52&#46;36]反复同行了落魄&#10;[02&#58;58&#46;38]&#10;[03&#58;05&#46;24]不再&#32;相信&#32;期许&#10;[03&#58;10&#46;05]它恐惧未知的世界&#10;[03&#58;13&#46;09]&#10;[03&#58;14&#46;04]对峙&#32;冷眼&#32;它迎战假想的仇敌&#10;[03&#58;19&#46;98]&#10;[03&#58;20&#46;68]怀疑&#32;不安&#10;[03&#58;23&#46;71]将它从温暖中高高抛起&#10;[03&#58;29&#46;74]再&#32;落不回原地&#10;[03&#58;33&#46;25]被信任遗弃&#32;只能拥抱自己&#10;[03&#58;40&#46;07]梦里的魔鬼哼着&#32;一首歌&#10;[03&#58;49&#46;21]&#10;[03&#58;53&#46;71]哒哒哒哒哒&#32;哒哒哒哒哒&#10;[03&#58;59&#46;96]&#10;[04&#58;00&#46;71]哒哒哒哒哒&#32;哒哒哒哒哒&#10;[04&#58;09&#46;45]&#10;[04&#58;12&#46;03]孤独的小孩&#32;受伤的心&#10;[04&#58;17&#46;77]&#10;[04&#58;19&#46;04]它只是太固执&#32;太温柔&#10;[04&#58;24&#46;88]&#10;[04&#58;25&#46;97]我隔着玻璃&#32;静静地望着它&#10;[04&#58;31&#46;95]&#10;[04&#58;32&#46;72]我愿意用爱&#32;轻轻拥抱它","lyric_txt":"                                 胡桃夹子         张碧晨            词：张碧晨      曲：张碧晨      编曲：刘卓/邢迟      钢琴：刘卓      弦乐：亚洲爱乐乐团/首席/李朋      和声编写：Brandy   Tien      和声：Brandy   Tien      混音：赵靖            它   摊开双手   它   垂着头            它   从来看不到   这周遭            它   站住双脚   它   冰冻了脸庞            它不曾察觉   眼中的迷惘            蒙尘的镜子里面   困住一个人      触不到   时光里的温度      胆怯的心跳   骄傲的头      抚平的只是孤独      观望着喜怒哀乐   变换的故事      它注定   被寂寞囚牢      它反复逃离反复失落      反复同行了落魄            风触碰悲伤   带不走痛            可它   早就不在乎   痛不痛            张不开的口   再咬不开外壳      它决然抹去   全部的存在            蒙尘的镜子里面困住一个人      触不到   时光里的温度      胆怯的心跳   骄傲的头      抚平的只是孤独            观望着喜怒哀乐   变换的故事      它注定   被寂寞囚牢      它反复逃离反复失落      反复同行了落魄            不再   相信   期许      它恐惧未知的世界            对峙   冷眼   它迎战假想的仇敌            怀疑   不安      将它从温暖中高高抛起      再   落不回原地      被信任遗弃   只能拥抱自己      梦里的魔鬼哼着   一首歌            哒哒哒哒哒   哒哒哒哒哒            哒哒哒哒哒   哒哒哒哒哒            孤独的小孩   受伤的心            它只是太固执   太温柔            我隔着玻璃   静静地望着它            我愿意用爱   轻轻拥抱它"}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * ret_code : 0
         * lyric : [ti&#58;胡桃夹子&#32;&#40;《健忘村》电影推广曲&#41;]&#10;[ar&#58;张碧晨]&#10;[al&#58;胡桃夹子]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;10]胡桃夹子&#32;&#45;&#32;张碧晨&#10;[00&#58;00&#46;20]&#10;[00&#58;05&#46;21]词：张碧晨&#10;[00&#58;06&#46;03]曲：张碧晨&#10;[00&#58;06&#46;85]编曲：刘卓/邢迟&#10;[00&#58;08&#46;17]钢琴：刘卓&#10;[00&#58;09&#46;00]弦乐：亚洲爱乐乐团/首席/李朋&#10;[00&#58;11&#46;45]和声编写：Brandy&#32;Tien&#10;[00&#58;12&#46;57]和声：Brandy&#32;Tien&#10;[00&#58;13&#46;38]混音：赵靖&#10;[00&#58;16&#46;05]&#10;[00&#58;17&#46;90]它&#32;摊开双手&#32;它&#32;垂着头&#10;[00&#58;24&#46;24]&#10;[00&#58;25&#46;19]它&#32;从来看不到&#32;这周遭&#10;[00&#58;30&#46;97]&#10;[00&#58;31&#46;97]它&#32;站住双脚&#32;它&#32;冰冻了脸庞&#10;[00&#58;38&#46;23]&#10;[00&#58;39&#46;01]它不曾察觉&#32;眼中的迷惘&#10;[00&#58;46&#46;75]&#10;[00&#58;47&#46;68]蒙尘的镜子里面&#32;困住一个人&#10;[00&#58;53&#46;22]触不到&#32;时光里的温度&#10;[00&#58;57&#46;83]胆怯的心跳&#32;骄傲的头&#10;[01&#58;02&#46;39]抚平的只是孤独&#10;[01&#58;07&#46;71]观望着喜怒哀乐&#32;变换的故事&#10;[01&#58;12&#46;90]它注定&#32;被寂寞囚牢&#10;[01&#58;18&#46;25]它反复逃离反复失落&#10;[01&#58;23&#46;34]反复同行了落魄&#10;[01&#58;29&#46;96]&#10;[01&#58;47&#46;19]风触碰悲伤&#32;带不走痛&#10;[01&#58;53&#46;00]&#10;[01&#58;53&#46;86]可它&#32;早就不在乎&#32;痛不痛&#10;[02&#58;00&#46;05]&#10;[02&#58;00&#46;86]张不开的口&#32;再咬不开外壳&#10;[02&#58;07&#46;76]它决然抹去&#32;全部的存在&#10;[02&#58;15&#46;03]&#10;[02&#58;16&#46;44]蒙尘的镜子里面困住一个人&#10;[02&#58;21&#46;99]触不到&#32;时光里的温度&#10;[02&#58;26&#46;76]胆怯的心跳&#32;骄傲的头&#10;[02&#58;31&#46;30]抚平的只是孤独&#10;[02&#58;36&#46;02]&#10;[02&#58;36&#46;62]观望着喜怒哀乐&#32;变换的故事&#10;[02&#58;41&#46;88]它注定&#32;被寂寞囚牢&#10;[02&#58;47&#46;14]它反复逃离反复失落&#10;[02&#58;52&#46;36]反复同行了落魄&#10;[02&#58;58&#46;38]&#10;[03&#58;05&#46;24]不再&#32;相信&#32;期许&#10;[03&#58;10&#46;05]它恐惧未知的世界&#10;[03&#58;13&#46;09]&#10;[03&#58;14&#46;04]对峙&#32;冷眼&#32;它迎战假想的仇敌&#10;[03&#58;19&#46;98]&#10;[03&#58;20&#46;68]怀疑&#32;不安&#10;[03&#58;23&#46;71]将它从温暖中高高抛起&#10;[03&#58;29&#46;74]再&#32;落不回原地&#10;[03&#58;33&#46;25]被信任遗弃&#32;只能拥抱自己&#10;[03&#58;40&#46;07]梦里的魔鬼哼着&#32;一首歌&#10;[03&#58;49&#46;21]&#10;[03&#58;53&#46;71]哒哒哒哒哒&#32;哒哒哒哒哒&#10;[03&#58;59&#46;96]&#10;[04&#58;00&#46;71]哒哒哒哒哒&#32;哒哒哒哒哒&#10;[04&#58;09&#46;45]&#10;[04&#58;12&#46;03]孤独的小孩&#32;受伤的心&#10;[04&#58;17&#46;77]&#10;[04&#58;19&#46;04]它只是太固执&#32;太温柔&#10;[04&#58;24&#46;88]&#10;[04&#58;25&#46;97]我隔着玻璃&#32;静静地望着它&#10;[04&#58;31&#46;95]&#10;[04&#58;32&#46;72]我愿意用爱&#32;轻轻拥抱它
         * lyric_txt :                                  胡桃夹子         张碧晨            词：张碧晨      曲：张碧晨      编曲：刘卓/邢迟      钢琴：刘卓      弦乐：亚洲爱乐乐团/首席/李朋      和声编写：Brandy   Tien      和声：Brandy   Tien      混音：赵靖            它   摊开双手   它   垂着头            它   从来看不到   这周遭            它   站住双脚   它   冰冻了脸庞            它不曾察觉   眼中的迷惘            蒙尘的镜子里面   困住一个人      触不到   时光里的温度      胆怯的心跳   骄傲的头      抚平的只是孤独      观望着喜怒哀乐   变换的故事      它注定   被寂寞囚牢      它反复逃离反复失落      反复同行了落魄            风触碰悲伤   带不走痛            可它   早就不在乎   痛不痛            张不开的口   再咬不开外壳      它决然抹去   全部的存在            蒙尘的镜子里面困住一个人      触不到   时光里的温度      胆怯的心跳   骄傲的头      抚平的只是孤独            观望着喜怒哀乐   变换的故事      它注定   被寂寞囚牢      它反复逃离反复失落      反复同行了落魄            不再   相信   期许      它恐惧未知的世界            对峙   冷眼   它迎战假想的仇敌            怀疑   不安      将它从温暖中高高抛起      再   落不回原地      被信任遗弃   只能拥抱自己      梦里的魔鬼哼着   一首歌            哒哒哒哒哒   哒哒哒哒哒            哒哒哒哒哒   哒哒哒哒哒            孤独的小孩   受伤的心            它只是太固执   太温柔            我隔着玻璃   静静地望着它            我愿意用爱   轻轻拥抱它
         */

        private int ret_code;
        private String lyric;
        private String lyric_txt;

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public String getLyric() {
            return lyric;
        }

        public void setLyric(String lyric) {
            this.lyric = lyric;
        }

        public String getLyric_txt() {
            return lyric_txt;
        }

        public void setLyric_txt(String lyric_txt) {
            this.lyric_txt = lyric_txt;
        }
    }
}
